In [3]:
import pandas as pd
import os
student_data= os.path .join('../school_district_analysis/new_student_data.csv')
Student_df=pd.read_csv(student_data)
student_df.head()

NameError: name 'student_df' is not defined

In [3]:
import pandas as pd
import numpy as np

apple_df = pd.DataFrame({"AAPL": [72.27, np.nan, 74.39, np.nan, 75.94, 76.93,np.nan, 78.74, np.nan, 79.81, np.nan, 79.53, np.nan, 79.56, 79.49]})

apple_df

apple_df.isnull().sum()

AAPL    6
dtype: int64

In [14]:
import pandas as pd
import numpy as np
daily_returns = pd.DataFrame({
    "AAPL": [0.5, np.nan, 0.62],
    "GOOG": [0.45, 0.63, 0.55]
})
daily_returns
daily_returns.fillna(daily_returns.mean())

   AAPL  GOOG
0  0.50  0.45
1  0.56  0.63
2  0.62  0.55

In [20]:
import pandas as pd
best_actors_df = pd.DataFrame({
    "Best Actors": ["Nic Cage", "Nic Cage", "Harrison Ford"]
})
best_actors_df = best_actors_df.drop_duplicates()
best_actors_df

     Best Actors
0       Nic Cage
2  Harrison Ford

In [39]:
import pandas as pd

prices = pd.DataFrame({"price_usd": ["$0.53", "$0.22", "0.34"]})
prices.loc[:, "price_usd"] = prices.loc[:, "price_usd"].str.replace("$", "")
prices

C:\Users\Nik\anaconda3\envs\PythonData\lib\site-packages\ipykernel_launcher.py:4: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  after removing the cwd from sys.path.

  price_usd
0      0.53
1      0.22
2      0.34

In [40]:
prices.dtypes

price_usd    object
dtype: object

In [42]:
prices.loc[:, "price_usd"]= prices.loc[:, "price_usd"].astype("float")
prices.dtypes

price_usd    float64
dtype: object

In [61]:
sales_df = pd.DataFrame({"item": ["tomatoes", "onions", "potatoes", "tomatoes", "mushrooms"],
                "quantity": [15, 26, 10, 12, 2],
                "total_price": [50.25, 39.52, 50.01, 40.20, 8.46]})
sales_df.head()

        item  quantity  total_price
0   tomatoes        15        50.25
1     onions        26        39.52
2   potatoes        10        50.01
3   tomatoes        12        40.20
4  mushrooms         2         8.46

In [62]:
sales_df.describe()

        quantity  total_price
count   5.000000     5.000000
mean   13.000000    37.688000
std     8.717798    17.128761
min     2.000000     8.460000
25%    10.000000    39.520000
50%    12.000000    40.200000
75%    15.000000    50.010000
max    26.000000    50.250000

In [63]:
sales_df["quantity"] > 10

0     True
1     True
2    False
3     True
4    False
Name: quantity, dtype: bool

In [68]:
sales_df = pd.DataFrame({"item": ["tomatoes", "onions", "potatoes", "tomatoes", "mushrooms"],
                "quantity": [15, 26, 10, 12, 2],
                "total_price": [50.25, 39.52, 50.01, 40.20, 8.46]})

In [70]:
sales_df.loc[(sales_df['quantity']>10) & (sales_df['total_price']<45)]

       item  quantity  total_price
1    onions        26        39.52
3  tomatoes        12        40.20

In [71]:
sales_df.loc[(sales_df['quantity']>10) | (sales_df['total_price']<45)]

        item  quantity  total_price
0   tomatoes        15        50.25
1     onions        26        39.52
3   tomatoes        12        40.20
4  mushrooms         2         8.46

In [74]:
min_price=sales_df['total_price'].min()
min_price_row= sales_df.loc[sales_df['total_price']==min_price]
min_price_row

        item  quantity  total_price
4  mushrooms         2         8.46

In [78]:
max_price= sales_df['total_price'].max()
max_price_row= sales_df.loc[sales_df['total_price'] == max_price]
max_price_row

       item  quantity  total_price
0  tomatoes        15        50.25

In [79]:
sales_df.loc[sales_df['item']== 'tomatoes',['total_price']].mean()

total_price    45.225
dtype: float64

In [80]:
sales_df.iloc[0:3, [0, 2]]

       item  total_price
0  tomatoes        50.25
1    onions        39.52
2  potatoes        50.01

In [81]:
sales_df.loc[sales_df['item']=='tomatoes',['quantity', 'total_price']]

   quantity  total_price
0        15        50.25
3        12        40.20

In [82]:
sales_df.loc[:, ["item", "total_price"]]

        item  total_price
0   tomatoes        50.25
1     onions        39.52
2   potatoes        50.01
3   tomatoes        40.20
4  mushrooms         8.46

In [83]:
sales_df.sort_values('total_price')

        item  quantity  total_price
4  mushrooms         2         8.46
1     onions        26        39.52
3   tomatoes        12        40.20
2   potatoes        10        50.01
0   tomatoes        15        50.25

In [85]:
sales_df.sort_values('total_price', ascending = False)

        item  quantity  total_price
0   tomatoes        15        50.25
2   potatoes        10        50.01
3   tomatoes        12        40.20
1     onions        26        39.52
4  mushrooms         2         8.46

In [86]:
sales_df.sort_values(['total_price','item'], ascending= False)

        item  quantity  total_price
0   tomatoes        15        50.25
2   potatoes        10        50.01
3   tomatoes        12        40.20
1     onions        26        39.52
4  mushrooms         2         8.46

In [51]:
import pandas as pd

goog_df = pd.DataFrame({"AAPL": [1045.85, 1070.08, 1140.99, 1113.65, 1193.32, 1231.54, 1215.00, 1207.15,1248.84, 1166.27, 1138.85, 1003.63, 1080.91]})

goog_df
goog_df.describe()

              AAPL
count    13.000000
mean   1142.775385
std      76.556568
min    1003.630000
25%    1080.910000
50%    1140.990000
75%    1207.150000
max    1248.840000

In [52]:
min_price = sales_df["total_price"].min()
min_price

8.46

In [53]:
# Create a DataFrame
aapl_returns = pd.DataFrame({"AAPL": [0.5, 0.56, 0.59, 0.52, 0.1]})

# Select the first row using iloc
aapl_returns.iloc[0]

AAPL    0.5
Name: 0, dtype: float64

In [55]:
aapl_returns = pd.DataFrame({"AAPL": [0.5, 0.56, 0.59, 0.52, 0.1, 0.75, 0.47]})
aapl_returns.iloc[4:]

   AAPL
4  0.10
5  0.75
6  0.47

In [57]:
aapl_returns = pd.DataFrame({"AAPL": [0.5, 0.56, 0.59, 0.52, 0.1, 0.75, 0.47]})
aapl_returns.iloc[-3:]

   AAPL
4  0.10
5  0.75
6  0.47

In [58]:
import numpy as np
revenue_df = pd.DataFrame(
    np.random.randint(low=1, high=1000, size=1000),
    index=pd.date_range('1/1/2017', periods=1000),
    columns=["revenue"])
revenue_df.tail()

            revenue
2019-09-23      208
2019-09-24      858
2019-09-25      128
2019-09-26      478
2019-09-27      870

In [59]:
# Select the last quarter of 2018 to the first quarter of 2019
revenue_df.loc['2018-10-01':'2019-03-31']

            revenue
2018-10-01      515
2018-10-02      638
2018-10-03      388
2018-10-04      208
2018-10-05      530
...             ...
2019-03-27      190
2019-03-28      641
2019-03-29      710
2019-03-30      797
2019-03-31      969

[182 rows x 1 columns]

In [60]:
# Describe the data by using summary statistics
revenue_df.loc['2018-10-01':'2019-03-31'].describe()

          revenue
count  182.000000
mean   450.412088
std    278.100027
min      5.000000
25%    193.000000
50%    410.500000
75%    683.500000
max    969.000000